bigramms_right = {
    'а': ['л', 'н', 'с', 'т', 'р', 'в', 'к', 'м'],
    'б': ['о', 'ы', 'е', 'а', 'р', 'у'],
    'в': ['о', 'а', 'и', 'ы', 'с', 'н', 'л', 'р'],
    'г': ['о', 'а', 'р', 'л', 'и', 'в'],
    'д': ['е', 'а', 'и', 'о', 'н', 'у', 'р', 'в'],
    'е': ['н', 'т', 'р', 'с', 'л', 'в', 'м', 'и'],
    'ж': ['е', 'и', 'д', 'а', 'н'],
    'з': ['а', 'н', 'в', 'о', 'м', 'д'],
    'и': ['с', 'н', 'в', 'и', 'е', 'м', 'к', 'з'],
    'к': ['о', 'а', 'и', 'р', 'у', 'т', 'л', 'е'],
    'л': ['и', 'е', 'о', 'а', 'ь', 'я', 'ю', 'у'],
    'м': ['и', 'е', 'о', 'у', 'а', 'н', 'п', 'ы'],
    'н': ['о', 'а', 'и', 'е', 'ы', 'н', 'у'],
    'о': ['в', 'с', 'т', 'р', 'и', 'д', 'н', 'м'],
    'п': ['о', 'р', 'е', 'а', 'у', 'и', 'л'],
    'р': ['а', 'е', 'о', 'и', 'у', 'я', 'ы', 'н'],
    'с': ['т', 'к', 'о', 'я', 'е', 'ь', 'с', 'н'],
    'т': ['о', 'а', 'е', 'и', 'ь', 'в', 'р', 'с'],
    'у': ['т', 'п', 'с', 'д', 'н', 'ю', 'ж'],
    'ф': ['и', 'е', 'о', 'а', 'е', 'о', 'а'],
    'х': ['о', 'и', 'с', 'н', 'в', 'п', 'р'],
    'ц': ['и', 'е', 'а', 'ы'],
    'ч': ['е', 'и', 'т', 'н'],
    'ш': ['е', 'и', 'н', 'а', 'о', 'л' ],
    'щ': ['е', 'и', 'а'],
    'ы': ['л', 'х', 'е', '`м', 'и', 'в', 'с', 'н'],
    'ь': ['н', 'к', 'в', '`п', 'с', 'е', 'о', 'и'],
    'э': ['н', 'т', 'р', '`с', 'к'],
    'ю': ['д', 'т', 'щ', '`ц', 'н', 'п' ],
    'я': ['в', 'с', 'т', '`п', 'д', 'к', 'м', 'л']
}
# Биграммы, от самых вероятных до менее
bi = ["то", "ст", "но", "на", "по", "не", "ен", "ов","ко", "ни", "он", "ос", "ал", "ра", "от", "ли","ро", "ер", "го", "ка", "пр", "ол", "во", "ет","ес", "ре", "ло", "ан", "ор", "ом"]

# Триграммы, от самых вероятных до менее
three = ["ост", "что", "про", "его", "ени", "ого","ста", "ать", "ото", "при", "ест", "енн","это", "сто", "аза", "ств", "тор", "оро","ере", "оль", "как", "она", "ова", "был","али", "лся", "все", "вер", "тел", "льн"]